abusous2000/uGFX-2.7/boards/base/STM32F769i-Discovery/STM32DSI.c
	    if (hdsi->MspInitCallback == NULL)
	    {
	      hdsi->MspInitCallback = HAL_DSI_MspInit;
	    }
	    /* Initialize the low level hardware */
	    hdsi->MspInitCallback(hdsi);
	  }
	#else
	  if (hdsi->State == HAL_DSI_STATE_RESET)
	  {
	    /* Initialize the low level hardware */
	    HAL_DSI_MspInit(hdsi);
	  }
	#endif /* USE_HAL_DSI_REGISTER_CALLBACKS */

	  /* Change DSI peripheral state */
	  hdsi->State = HAL_DSI_STATE_BUSY;

	  /**************** Turn on the regulator and enable the DSI PLL ****************/

	  /* Enable the regulator */
	  __HAL_DSI_REG_ENABLE(DSI);

//	  /* Get tick */
//	  tickstart = HAL_GetTick();
//
//	  /* Wait until the regulator is ready */
//	  while (__HAL_DSI_GET_FLAG(hdsi, DSI_FLAG_RRS) == 0U)
//	  {
//	    /* Check for the Timeout */
//	    if ((HAL_GetTick() - tickstart) > DSI_TIMEOUT_VALUE)
//	    {
//	      return HAL_TIMEOUT;
//	    }
//	  }
	  __HAL_DSI_REG_ENABLE(DSI);

	   /* Enable the regulator */
	  WAIT_FOR_DSI_FLAG(DSI->WISR & DSI_WISR_RRS);

	  /* Set the PLL division factors */
	  hdsi->Instance->WRPCR &= ~(DSI_WRPCR_PLL_NDIV | DSI_WRPCR_PLL_IDF | DSI_WRPCR_PLL_ODF);
	  hdsi->Instance->WRPCR |= (((PLLInit->PLLNDIV) << 2U) | ((PLLInit->PLLIDF) << 11U) | ((PLLInit->PLLODF) << 16U));

	  /* Enable the DSI PLL */
	  __HAL_DSI_PLL_ENABLE();

	  /* Get tick */
//	  tickstart = HAL_GetTick();
//
//	  /* Wait for the lock of the PLL */
//	  while (__HAL_DSI_GET_FLAG(hdsi, DSI_FLAG_PLLLS) == 0U)
//	  {
//	    /* Check for the Timeout */
//	    if ((HAL_GetTick() - tickstart) > DSI_TIMEOUT_VALUE)
//	    {
//	      return HAL_TIMEOUT;
//	    }
//	  }
	  WAIT_FOR_DSI_FLAG(DSI->WISR & DSI_FLAG_PLLLS);
	  /*************************** Set the PHY parameters ***************************/

	  /* D-PHY clock and digital enable*/
	  hdsi->Instance->PCTLR |= (DSI_PCTLR_CKE | DSI_PCTLR_DEN);

	  /* Clock lane configuration */
	  hdsi->Instance->CLCR &= ~(DSI_CLCR_DPCC | DSI_CLCR_ACR);
	  hdsi->Instance->CLCR |= (DSI_CLCR_DPCC | hdsi->Init.AutomaticClockLaneControl);

	  /* Configure the number of active data lanes */
	  hdsi->Instance->PCONFR &= ~DSI_PCONFR_NL;
	  hdsi->Instance->PCONFR |= hdsi->Init.NumberOfLanes;

	  /************************ Set the DSI clock parameters ************************/

	  /* Set the TX escape clock division factor */
	  hdsi->Instance->CCR &= ~DSI_CCR_TXECKDIV;
	  hdsi->Instance->CCR |= hdsi->Init.TXEscapeCkdiv;

	  /* Calculate the bit period in high-speed mode in unit of 0.25 ns (UIX4) */
	  /* The equation is : UIX4 = IntegerPart( (1000/F_PHY_Mhz) * 4 )          */
	  /* Where : F_PHY_Mhz = (NDIV * HSE_Mhz) / (IDF * ODF)                    */
	  tempIDF = (PLLInit->PLLIDF > 0U) ? PLLInit->PLLIDF : 1U;
	  unitIntervalx4 = (4000000U * tempIDF * ((1UL << (0x3U & PLLInit->PLLODF)))) / ((HSE_VALUE / 1000U) * PLLInit->PLLNDIV);

	  /* Set the bit period in high-speed mode */
	  hdsi->Instance->WPCR[0U] &= ~DSI_WPCR0_UIX4;
	  hdsi->Instance->WPCR[0U] |= unitIntervalx4;

	  /****************************** Error management *****************************/

	  /* Disable all error interrupts and reset the Error Mask */
	  hdsi->Instance->IER[0U] = 0U;
	  hdsi->Instance->IER[1U] = 0U;
	  hdsi->ErrorMsk = 0U;

	  /* Initialise the error code */
	  hdsi->ErrorCode = HAL_DSI_ERROR_NONE;

	  /* Initialize the DSI state*/
	  hdsi->State = HAL_DSI_STATE_READY;

	  return HAL_OK;
}

void BSP_LCD_MspInit(void)
{
	 __HAL_RCC_LTDC_CLK_ENABLE();
		  /** @brief Toggle Sw reset of LTDC IP */
		  __HAL_RCC_LTDC_FORCE_RESET();
		  __HAL_RCC_LTDC_RELEASE_RESET();
		  /** @brief Enable the DMA2D clock */
		  __HAL_RCC_DMA2D_CLK_ENABLE();
		  /** @brief Toggle Sw reset of DMA2D IP */
		  __HAL_RCC_DMA2D_FORCE_RESET();
		  __HAL_RCC_DMA2D_RELEASE_RESET();
		  /** @brief Enable DSI Host and wrapper clocks */
		  __HAL_RCC_DSI_CLK_ENABLE();
		  /** @brief Soft Reset the DSI Host and wrapper */
		  __HAL_RCC_DSI_FORCE_RESET();
		  __HAL_RCC_DSI_RELEASE_RESET();

		  //			  NVIC_SetPriority(SDRAM_DMAx_IRQn, NVIC_EncodePriority(NVIC_GetPriorityGrouping(), 5, 0));
	////			  /** @brief NVIC configuration for LTDC interrupt that is now enabled */
	//			  nvicEnableVector(LTDC_IRQn, 3);//			  HAL_NVIC_SetPriority(LTDC_IRQn, 3, 0);
	//			  HAL_NVIC_EnableIRQ(LTDC_IRQn);
		  NVIC_SetPriority(LTDC_IRQn, NVIC_EncodePriority(NVIC_GetPriorityGrouping(), 3, 0));
		  /* Enable interrupt */
		  NVIC_EnableIRQ(LTDC_IRQn);

	//			  /** @brief NVIC configuration for DMA2D interrupt that is now enabled */
	//			  nvicEnableVector(DMA2D_IRQn, 3);//			  HAL_NVIC_SetPriority(DMA2D_IRQn, 3, 0);
	//			  HAL_NVIC_EnableIRQ(DMA2D_IRQn);
		  NVIC_SetPriority(DMA2D_IRQn, NVIC_EncodePriority(NVIC_GetPriorityGrouping(), 3, 0));
		  /* Enable interrupt */
		  NVIC_EnableIRQ(DMA2D_IRQn);
}
int initDSI(orientation_t orientation){
	 BSP_LCD_Reset();
	//No need to initialize clocks, it was done in ChibiOS ...see mcuconf.h
//	see line 360 BSP_LCD_InitEx@stm32f769i_discovery_lcd.c
			//1-Make sure ur close is set at 200MHz
//			  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE;
//			  RCC_OscInitStruct.HSEState = RCC_HSE_ON;
//			  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
//			  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;
//			  RCC_OscInitStruct.PLL.PLLM = 25;
//			  RCC_OscInitStruct.PLL.PLLN = 400;
//			  RCC_OscInitStruct.PLL.PLLP = RCC_PLLP_DIV2;
//			  RCC_OscInitStruct.PLL.PLLQ = 8;
//			  RCC_OscInitStruct.PLL.PLLR = 7;
			//2-#define STM32_LCDTFT_REQUIRED               TRUE
//			 3-BSP_LCD_Reset(void)
//			Star--->BSP_LCD_MspInit()@stm32f769i_discovery_lcd.c

	 __HAL_RCC_LTDC_CLK_ENABLE();
	  /** @brief Toggle Sw reset of LTDC IP */
	  __HAL_RCC_LTDC_FORCE_RESET();
	  __HAL_RCC_LTDC_RELEASE_RESET();
	  /** @brief Enable the DMA2D clock */
	  __HAL_RCC_DMA2D_CLK_ENABLE();
	  /** @brief Toggle Sw reset of DMA2D IP */
	  __HAL_RCC_DMA2D_FORCE_RESET();
	  __HAL_RCC_DMA2D_RELEASE_RESET();
	  /** @brief Enable DSI Host and wrapper clocks */
	  __HAL_RCC_DSI_CLK_ENABLE();
	  /** @brief Soft Reset the DSI Host and wrapper */
	  __HAL_RCC_DSI_FORCE_RESET();
	  __HAL_RCC_DSI_RELEASE_RESET();

