abusous2000/uGFX-2.7/boards/base/STM32F769i-Discovery/STM32DSI.c
	  //			  NVIC_SetPriority(SDRAM_DMAx_IRQn, NVIC_EncodePriority(NVIC_GetPriorityGrouping(), 5, 0));
////			  /** @brief NVIC configuration for LTDC interrupt that is now enabled */
//			  nvicEnableVector(LTDC_IRQn, 3);//			  HAL_NVIC_SetPriority(LTDC_IRQn, 3, 0);
//			  HAL_NVIC_EnableIRQ(LTDC_IRQn);
	  NVIC_SetPriority(LTDC_IRQn, NVIC_EncodePriority(NVIC_GetPriorityGrouping(), 3, 0));
	  /* Enable interrupt */
	  NVIC_EnableIRQ(LTDC_IRQn);

//			  /** @brief NVIC configuration for DMA2D interrupt that is now enabled */
//			  nvicEnableVector(DMA2D_IRQn, 3);//			  HAL_NVIC_SetPriority(DMA2D_IRQn, 3, 0);
//			  HAL_NVIC_EnableIRQ(DMA2D_IRQn);
	  NVIC_SetPriority(DMA2D_IRQn, NVIC_EncodePriority(NVIC_GetPriorityGrouping(), 3, 0));
	  /* Enable interrupt */
	  NVIC_EnableIRQ(DMA2D_IRQn);

//			  /** @brief NVIC configuration for DSI interrupt that is now enabled */
//			  nvicEnableVector(DSI_IRQn, 3);//			  HAL_NVIC_SetPriority(DSI_IRQn, 3, 0);
//			  HAL_NVIC_EnableIRQ(DSI_IRQn);
	  NVIC_SetPriority(DSI_IRQn, NVIC_EncodePriority(NVIC_GetPriorityGrouping(), 3, 0));
	  /* Enable interrupt */
	  NVIC_EnableIRQ(DSI_IRQn);

//	Ends--->BSP_LCD_MspInit()@stm32f769i_discovery_lcd.c

	  //HAL_DSI_Init()--->Starts
	  uint32_t PLLNDIV    = 100;
	  uint32_t PLLIDF     = DSI_PLL_IN_DIV5;
	  uint32_t PLLODF     = DSI_PLL_OUT_DIV1;
	  /* Set number of Lanes */
	  uint32_t InitNumberOfLanes = DSI_TWO_DATA_LANES;
	  /************************ Set the DSI clock parameters ************************/
	  uint32_t laneByteClk_kHz = 62500; /* 500 MHz / 8 = 62.5 MHz = 62500 kHz */
	  /* TXEscapeCkdiv = f(LaneByteClk)/15.62 = 4 */
	  uint32_t InitTXEscapeCkdiv = laneByteClk_kHz/15620;
	  /* Set the TX escape clock division factor */

	  ///Start----->HAL_DSI_DeInit(&(hdsi_discovery));
	  __HAL_DSI_WRAPPER_DISABLE(DSI);

	  /* Disable the DSI host */
	  __HAL_DSI_DISABLE(DSI);

	  /* D-PHY clock and digital disable */
	  DSI->PCTLR &= ~(DSI_PCTLR_CKE | DSI_PCTLR_DEN);

	  /* Turn off the DSI PLL */
	  __HAL_DSI_PLL_DISABLE(DSI);

	  /* Disable the regulator */
	  __HAL_DSI_REG_DISABLE(DSI);

	  ///ENDs----->HAL_DSI_DeInit(&(hdsi_discovery));

	  /* Turn off the DSI PLL */
	  __HAL_DSI_PLL_DISABLE(DSI);

	  /* Disable the regulator */
	  __HAL_DSI_REG_DISABLE(DSI);


	  //Start----> 4-HAL_DSI_Init() set up DSI clock and registers

	  __HAL_DSI_REG_ENABLE(DSI);

	   /* Enable the regulator */
	  WAIT_FOR_DSI_FLAG(DSI->WISR & DSI_WISR_RRS);


	  /* Set the PLL division factors */
	  DSI->WRPCR &= ~(DSI_WRPCR_PLL_NDIV | DSI_WRPCR_PLL_IDF | DSI_WRPCR_PLL_ODF);
	  DSI->WRPCR |= (((PLLNDIV) << 2U) | ((PLLIDF) << 11U) | ((PLLODF) << 16U));

	  __HAL_DSI_PLL_ENABLE();
	  WAIT_FOR_DSI_FLAG(DSI->WISR & DSI_FLAG_PLLLS);


    /*************************** Set the PHY parameters ***************************/
	  /* D-PHY clock and digital enable*/
	  DSI->PCTLR |= (DSI_PCTLR_CKE | DSI_PCTLR_DEN);
	  uint32_t AutomaticClockLaneControl = DSI_AUTO_CLK_LANE_CTRL_DISABLE;
	  /* Clock lane configuration */
	  DSI->CLCR &= ~(DSI_CLCR_DPCC | DSI_CLCR_ACR);
	  DSI->CLCR |= (DSI_CLCR_DPCC | AutomaticClockLaneControl);


	  /* Configure the number of active data lanes */
	  DSI->PCONFR &= ~DSI_PCONFR_NL;
	  DSI->PCONFR |= InitNumberOfLanes;



	  DSI->CCR &= ~DSI_CCR_TXECKDIV;
	  DSI->CCR |= InitTXEscapeCkdiv;

	  /* Calculate the bit period in high-speed mode in unit of 0.25 ns (UIX4) */
	  /* The equation is : UIX4 = IntegerPart( (1000/F_PHY_Mhz) * 4 )          */
	  /* Where : F_PHY_Mhz = (NDIV * HSE_Mhz) / (IDF * ODF)                    */
	  uint32_t tempIDF = (PLLIDF > 0U) ? PLLIDF : 1U;
	  uint32_t unitIntervalx4 = (4000000U * tempIDF * ((1UL << (0x3U & PLLODF)))) / ((STM32_HSECLK  / 1000U) * PLLNDIV);

	  /* Set the bit period in high-speed mode */
	  DSI->WPCR[0U] &= ~DSI_WPCR0_UIX4;
	  DSI->WPCR[0U] |= unitIntervalx4;
	  /* Disable all error interrupts and reset the Error Mask */
	  DSI->IER[0U] = 0U;
	  DSI->IER[1U] = 0U;

	  //HAL_DSI_Init()-->Ends


      //5-See HAL_DSI_ConfigVideoMode() in stm32f7xx_hal_dsi.c

//			HAL_DSI_Init@stm32f7xx_hal_dsi.c
			  /* Get LTDC Configuration from DSI Configuration */
//			  HAL_LTDC_StructInitFromVideoConfig(&(hltdc_discovery), &(hdsivideo_handle));
	  /* Initialize the LTDC */
	  uint32_t lcd_x_size = OTM8009A_800X480_WIDTH;
	  uint32_t lcd_y_size = OTM8009A_800X480_HEIGHT;
	  if(orientation == GDISP_ROTATE_PORTRAIT)
	  {
	    lcd_x_size = OTM8009A_480X800_WIDTH;  /* 480 */
	    lcd_y_size = OTM8009A_480X800_HEIGHT; /* 800 */
	  }
	  else
	  {
	    lcd_x_size = OTM8009A_800X480_WIDTH;  /* 800 */
	    lcd_y_size = OTM8009A_800X480_HEIGHT; /* 480 */
	  }

	  uint32_t HACT = lcd_x_size;
	  uint32_t VACT = lcd_y_size;
	  uint32_t LcdClock  = 27429; /*!< LcdClk = 27429 kHz */
	  /* The following values are same for portrait and landscape orientations */
	  uint32_t VSA  = OTM8009A_480X800_VSYNC;        /* 12  */
	  uint32_t VBP  = OTM8009A_480X800_VBP;          /* 12  */
	  uint32_t VFP  = OTM8009A_480X800_VFP;          /* 12  */
	  uint32_t HSA  = OTM8009A_480X800_HSYNC;        /* 63  */
	  uint32_t HBP  = OTM8009A_480X800_HBP;          /* 120 */
	  uint32_t HFP  = OTM8009A_480X800_HFP;          /* 120 */

	  uint32_t VirtualChannelID = LCD_OTM8009A_ID;
	  uint32_t ColorCoding = LCD_DSI_PIXEL_DATA_FMT_RBG888;
	  uint32_t VSPolarity = DSI_VSYNC_ACTIVE_HIGH;
	  uint32_t HSPolarity = DSI_HSYNC_ACTIVE_HIGH;
	  uint32_t DEPolarity = DSI_DATA_ENABLE_ACTIVE_HIGH;
	  uint32_t Mode = DSI_VID_MODE_BURST; /* Mode Video burst ie : one LgP per line */
	  uint32_t NullPacketSize = 0xFFF;
	  uint32_t NumberOfChunks = 0;
	  uint32_t PacketSize                = HACT; /* Value depending on display orientation choice portrait/landscape */
	  uint32_t HorizontalSyncActive      = (HSA * laneByteClk_kHz)/LcdClock;
	  uint32_t HorizontalBackPorch       = (HBP * laneByteClk_kHz)/LcdClock;
	  uint32_t HorizontalLine            = ((HACT + HSA + HBP + HFP) * laneByteClk_kHz)/LcdClock; /* Value depending on display orientation choice portrait/landscape */
	  uint32_t VerticalSyncActive        = VSA;
	  uint32_t VerticalBackPorch         = VBP;
	  uint32_t VerticalFrontPorch        = VFP;
	  uint32_t VerticalActive            = VACT; /* Value depending on display orientation choice portrait/landscape */
	  /* Enable or disable sending LP command while streaming is active in video mode */
	  uint32_t LPCommandEnable = DSI_LP_COMMAND_ENABLE; /* Enable sending commands in mode LP (Low Power) */

	  /* Largest packet size possible to transmit in LP mode in VSA, VBP, VFP regions */
	  /* Only useful when sending LP packets is allowed while streaming is active in video mode */
	  uint32_t LPLargestPacketSize = 64;

	  /* Largest packet size possible to transmit in LP mode in HFP region during VACT period */
	  /* Only useful when sending LP packets is allowed while streaming is active in video mode */
	  uint32_t LPVACTLargestPacketSize = 64;

	  /* while streaming is active in video mode                                                                         */
	  uint32_t LPHorizontalFrontPorchEnable = DSI_LP_HFP_ENABLE;   /* Allow sending LP commands during HFP period */
	  uint32_t LPHorizontalBackPorchEnable  = DSI_LP_HBP_ENABLE;   /* Allow sending LP commands during HBP period */
	  uint32_t LPVerticalActiveEnable = DSI_LP_VACT_ENABLE;  /* Allow sending LP commands during VACT period */
	  uint32_t LPVerticalFrontPorchEnable = DSI_LP_VFP_ENABLE;   /* Allow sending LP commands during VFP period */
	  uint32_t LPVerticalBackPorchEnable = DSI_LP_VBP_ENABLE;   /* Allow sending LP commands during VBP period */
	  uint32_t LPVerticalSyncActiveEnable = DSI_LP_VSYNC_ENABLE; /* Allow sending LP commands during VSync = VSA period */
	  uint32_t FrameBTAAcknowledgeEnable = DSI_FBTAA_DISABLE;
//			  if(orientation == LCD_ORIENTATION_PORTRAIT)
			//6-Now you need to see LCD TFT clock to 27MHz
			  /* Timing Configuration */

