abusous2000/uGFX-2.7/boards/base/STM32F769i-Discovery/STM32DSI.c
	  uint32_t  Init_HorizontalSync = (HSA - 1);
	  uint32_t  Init_AccumulatedHBP = (HSA + HBP - 1);
	  uint32_t  Init_AccumulatedActiveW = (lcd_x_size + HSA + HBP - 1);
	  uint32_t  Init_TotalWidth = (lcd_x_size + HSA + HBP + HFP - 1);


	  //HAL_DSI_ConfigVideoMode--->Starts
	  /* Initialize the LCD pixel width and pixel height */
	  /* Select video mode by resetting CMDM and DSIM bits */
	  DSI->MCR &= ~DSI_MCR_CMDM;
	  DSI->WCFGR &= ~DSI_WCFGR_DSIM;

	  /* Configure the video mode transmission type */
	  DSI->VMCR &= ~DSI_VMCR_VMT;
	  DSI->VMCR |= Mode;

	  /* Configure the video packet size */
	  DSI->VPCR &= ~DSI_VPCR_VPSIZE;
	  DSI->VPCR |= PacketSize;

	  /* Set the chunks number to be transmitted through the DSI link */
	  DSI->VCCR &= ~DSI_VCCR_NUMC;
	  DSI->VCCR |= NumberOfChunks;

	  /* Set the size of the null packet */
	  DSI->VNPCR &= ~DSI_VNPCR_NPSIZE;
	  DSI->VNPCR |= NullPacketSize;

	  /* Select the virtual channel for the LTDC interface traffic */
	  DSI->LVCIDR &= ~DSI_LVCIDR_VCID;
	  DSI->LVCIDR |= VirtualChannelID;

	  /* Configure the polarity of control signals */
	  DSI->LPCR &= ~(DSI_LPCR_DEP | DSI_LPCR_VSP | DSI_LPCR_HSP);
	  DSI->LPCR |= (DEPolarity | VSPolarity | HSPolarity);

	  /* Select the color coding for the host */
	  DSI->LCOLCR &= ~DSI_LCOLCR_COLC;
	  DSI->LCOLCR |= ColorCoding;

	  /* Select the color coding for the wrapper */
	  DSI->WCFGR &= ~DSI_WCFGR_COLMUX;
	  DSI->WCFGR |= (ColorCoding << 1U);
	  uint32_t LooselyPacked        = DSI_LOOSELY_PACKED_DISABLE;
	  /* Enable/disable the loosely packed variant to 18-bit configuration */
	  if (ColorCoding == DSI_RGB666)
	  {
		DSI->LCOLCR &= ~DSI_LCOLCR_LPE;
		DSI->LCOLCR |= LooselyPacked;
	  }

	  /* Set the Horizontal Synchronization Active (HSA) in lane byte clock cycles */
	  DSI->VHSACR &= ~DSI_VHSACR_HSA;
	  DSI->VHSACR |= HorizontalSyncActive;

	  /* Set the Horizontal Back Porch (HBP) in lane byte clock cycles */
	  DSI->VHBPCR &= ~DSI_VHBPCR_HBP;
	  DSI->VHBPCR |= HorizontalBackPorch;

	  /* Set the total line time (HLINE=HSA+HBP+HACT+HFP) in lane byte clock cycles */
	  DSI->VLCR &= ~DSI_VLCR_HLINE;
	  DSI->VLCR |= HorizontalLine;


	  /* Set the Vertical Synchronization Active (VSA) */
	  DSI->VVSACR &= ~DSI_VVSACR_VSA;
	  DSI->VVSACR |= VerticalSyncActive;

	  /* Set the Vertical Back Porch (VBP)*/
	  DSI->VVBPCR &= ~DSI_VVBPCR_VBP;
	  DSI->VVBPCR |= VerticalBackPorch;

	  /* Set the Vertical Front Porch (VFP)*/
	  DSI->VVFPCR &= ~DSI_VVFPCR_VFP;
	  DSI->VVFPCR |= VerticalFrontPorch;

	  /* Set the Vertical Active period*/
	  DSI->VVACR &= ~DSI_VVACR_VA;
	  DSI->VVACR |= VerticalActive;

	  /* Configure the command transmission mode */
	  DSI->VMCR &= ~DSI_VMCR_LPCE;
	  DSI->VMCR |= LPCommandEnable;

	  /* Low power largest packet size */
	  DSI->LPMCR &= ~DSI_LPMCR_LPSIZE;
	  DSI->LPMCR |= ((LPLargestPacketSize) << 16U);

	  /* Low power VACT largest packet size */
	  DSI->LPMCR &= ~DSI_LPMCR_VLPSIZE;
	  DSI->LPMCR |= LPVACTLargestPacketSize;

	  /* Enable LP transition in HFP period */
	  DSI->VMCR &= ~DSI_VMCR_LPHFPE;
	  DSI->VMCR |= LPHorizontalFrontPorchEnable;

	  /* Enable LP transition in HBP period */
	  DSI->VMCR &= ~DSI_VMCR_LPHBPE;
	  DSI->VMCR |= LPHorizontalBackPorchEnable;

	  /* Enable LP transition in VACT period */
	  DSI->VMCR &= ~DSI_VMCR_LPVAE;
	  DSI->VMCR |= LPVerticalActiveEnable;

	  /* Enable LP transition in VFP period */
	  DSI->VMCR &= ~DSI_VMCR_LPVFPE;
	  DSI->VMCR |= LPVerticalFrontPorchEnable;

	  /* Enable LP transition in VBP period */
	  DSI->VMCR &= ~DSI_VMCR_LPVBPE;
	  DSI->VMCR |= LPVerticalBackPorchEnable;

	  /* Enable LP transition in vertical sync period */
	  DSI->VMCR &= ~DSI_VMCR_LPVSAE;
	  DSI->VMCR |= LPVerticalSyncActiveEnable;


	  /* Enable the request for an acknowledge response at the end of a frame */
	  DSI->VMCR &= ~DSI_VMCR_FBTAAE;
	  DSI->VMCR |= FrameBTAAcknowledgeEnable;
	  //Ends---->HAL_DSI_ConfigVideoMode--->

	  //HAL_RCCEx_PeriphCLKConfig Already done in chibiOS

	/*
	 * LCD clock configuration has been already configured in ChibiOS
	 * see mcuconf.h for detail
	 *
	 */
	  /** LCD clock configuration:
			    * Note: The following values should not be changed as the PLLSAI is also used
			    *      to clock the USB FS
			    * PLLSAI_VCO Input = HSE_VALUE/PLL_M = 1 Mhz
			    * PLLSAI_VCO Output = PLLSAI_VCO Input * PLLSAIN = 384 Mhz
			    * PLLLCDCLK = PLLSAI_VCO Output/PLLSAIR = 384 MHz / 7 = 54.85 MHz
			    * LTDC clock frequency = PLLLCDCLK / LTDC_PLLSAI_DIVR_2 = 54.85 MHz / 2 = 27.429 MHz

			  PeriphClkInitStruct.PeriphClockSelection = RCC_PERIPHCLK_LTDC;
			  PeriphClkInitStruct.PLLSAI.PLLSAIN = 384;
			  PeriphClkInitStruct.PLLSAI.PLLSAIR = 7;
			  PeriphClkInitStruct.PLLSAIDivR = RCC_PLLSAIDIVR_2;
			  HAL_RCCEx_PeriphCLKConfig(&PeriphClkInitStruct);
	   **/

	  //		HAL_StatusTypeDef HAL_LTDCEx_StructInitFromVideoConfig(LTDC_HandleTypeDef *hltdc, DSI_VidCfgTypeDef *VidCfg)
	  //		{
	  //		  /* Retrieve signal polarities from DSI */
	  //
	  //		  /* The following polarity is inverted:
	  //							 LTDC_DEPOLARITY_AL <-> LTDC_DEPOLARITY_AH */
	  //
	  //		  /* Note 1 : Code in line w/ Current LTDC specification */
	  			  uint32_t Init_DEPolarity = (DEPolarity == DSI_DATA_ENABLE_ACTIVE_HIGH) ? LTDC_DEPOLARITY_AL : LTDC_DEPOLARITY_AH;
	  			  uint32_t Init_VSPolarity = (VSPolarity == DSI_VSYNC_ACTIVE_HIGH) ? LTDC_VSPOLARITY_AH : LTDC_VSPOLARITY_AL;
	  			  uint32_t Init_HSPolarity = (HSPolarity == DSI_HSYNC_ACTIVE_HIGH) ? LTDC_HSPOLARITY_AH : LTDC_HSPOLARITY_AL;
	  			  ////
	  			  ////			  /* Note 2: Code to be used in case LTDC polarities inversion updated in the specification */
	  			  //			  int32_t Init_DEPolarity = DEPolarity << 29;
	  			  //			  int32_t Init_VSPolarity = VSPolarity << 29;
	  			  //			  int32_t Init_HSPolarity = HSPolarity << 29; */
	  			  //
	  			  //			  /* Retrieve vertical timing parameters from DSI */
	  			  int32_t Init_VerticalSync       = VerticalSyncActive - 1U;
	  			  int32_t Init_AccumulatedVBP     = VerticalSyncActive + VerticalBackPorch - 1U;
	  			  int32_t Init_AccumulatedActiveH = VerticalSyncActive + VerticalBackPorch + VerticalActive - 1U;
	  			  int32_t Init_TotalHeigh         = VerticalSyncActive + VerticalBackPorch + VerticalActive + VerticalFrontPorch - 1U;
	  			  uint8_t Init_Backcolor_Blue = 0;
	  			  uint8_t Init_Backcolor_Green = 0;
	  			  uint8_t Init_Backcolor_Red = 0;
	  			  int32_t Init_PCPolarity = LTDC_PCPOLARITY_IPC;
	  			  uint32_t  rgGCR = (uint32_t)(Init_HSPolarity | Init_VSPolarity | Init_DEPolarity | Init_PCPolarity);
	  			Init_Backcolor_Red = rgGCR;
#if 0 //def INCLUDES_ALL
			  ///HAL_LTDC_Init---->Starts

			  /* Configure the HS, VS, DE and PC polarity */
			  LTDC->GCR &= ~(LTDC_GCR_HSPOL | LTDC_GCR_VSPOL | LTDC_GCR_DEPOL | LTDC_GCR_PCPOL);
			  LTDC->GCR |= (uint32_t)(Init_HSPolarity | Init_VSPolarity | Init_DEPolarity | Init_PCPolarity);

