abusous2000/uGFX-2.7/boards/base/STM32F769i-Discovery/STM32DSI.c
			  /* Set Synchronization size */
			  LTDC->SSCR &= ~(LTDC_SSCR_VSH | LTDC_SSCR_HSW);
			  uint32_t tmp = (Init_HorizontalSync << 16U);
			  LTDC->SSCR |= (tmp | Init_VerticalSync);

			  /* Set Accumulated Back porch */
			  LTDC->BPCR &= ~(LTDC_BPCR_AVBP | LTDC_BPCR_AHBP);
			  tmp = (Init_AccumulatedHBP << 16U);
			  LTDC->BPCR |= (tmp | Init_AccumulatedVBP);

			  /* Set Accumulated Active Width */
			  LTDC->AWCR &= ~(LTDC_AWCR_AAH | LTDC_AWCR_AAW);
			  tmp = (Init_AccumulatedActiveW << 16U);
			  LTDC->AWCR |= (tmp | Init_AccumulatedActiveH);

			  /* Set Total Width */
			  LTDC->TWCR &= ~(LTDC_TWCR_TOTALH | LTDC_TWCR_TOTALW);
			  tmp = (Init_TotalWidth << 16U);
			  LTDC->TWCR |= (tmp | Init_TotalHeigh);

			  /* Set the background color value */
			  tmp = ((uint32_t)(Init_Backcolor_Green) << 8U);
			  uint32_t tmp1 = ((uint32_t)(Init_Backcolor_Red) << 16U);
			  LTDC->BCCR &= ~(LTDC_BCCR_BCBLUE | LTDC_BCCR_BCGREEN | LTDC_BCCR_BCRED);
			  LTDC->BCCR |= (tmp1 | tmp | Init_Backcolor_Blue);

			  /* Enable the Transfer Error and FIFO underrun interrupts */
			  __HAL_LTDC_ENABLE_IT(LTDC, LTDC_IT_TE | LTDC_IT_FU);

			  /* Enable LTDC by setting LTDCEN bit */
			  __HAL_LTDC_ENABLE(LTDC);
#endif
			  ///HAL_LTDC_Init---->Ends

			  //HAL_DSI_Start--->Start
			   __HAL_DSI_ENABLE(DSI);
			   __HAL_DSI_WRAPPER_ENABLE(DSI);
			   //HAL_DSI_Start--->Ends

#if 0//def INCLUDES_ALL
			   BSP_SDRAM_Init();
				  /* Initialize the font */
			//	BSP_LCD_SetFont(&LCD_DEFAULT_FONT);


				OTM8009A_Init(OTM8009A_FORMAT_RGB888, orientation);
				//
			//    BSP_TS_Init(800, 480);

//				BSP_LCD_DisplayOn();


			  ///Starts:BSP_LCD_LayerDefaultInit(1, LCD_FB_START_ADDRESS);-->Starts
#define LTDC_LAYER(__HANDLE__, __LAYER__)              ((LTDC_Layer_TypeDef *)((uint32_t)(((uint32_t)((__HANDLE__))) + 0x84U + (0x80U*(__LAYER__)))))

			  uint32_t  Layercfg_WindowX0 = 0;
			  uint32_t  Layercfg_WindowX1 = lcd_x_size;
			  uint32_t  Layercfg_WindowY0 = 0;
			  uint32_t  Layercfg_WindowY1 = lcd_y_size;
			  //uint32_t  Layercfg_PixelFormat = LTDC_PIXEL_FORMAT_RGB888;
			  uint32_t  Layercfg_PixelFormat = LTDC_PIXEL_FORMAT_ARGB8888;
			  uint32_t  Layercfg_FBStartAdress = (uint32_t)LCD_FB_START_ADDRESS;
			  uint32_t  Layercfg_Alpha = 255;
			  uint32_t  Layercfg_Alpha0 = 0;
			  uint8_t   Layercfg_Backcolor_Blue = 0;
			  uint8_t   Layercfg_Backcolor_Green = 0;
			  uint8_t   Layercfg_Backcolor_Red = 0;
			  uint32_t  Layercfg_BlendingFactor1 = LTDC_BLENDING_FACTOR1_PAxCA;
			  uint32_t  Layercfg_BlendingFactor2 = LTDC_BLENDING_FACTOR2_PAxCA;
			  uint32_t  Layercfg_ImageWidth =  lcd_x_size;
			  uint32_t  Layercfg_ImageHeight = lcd_y_size;
			  uint8_t LayerIdx = 1;
			  /* Configure the horizontal start and stop position */
			  tmp = ((Layercfg_WindowX1 + ((LTDC->BPCR & LTDC_BPCR_AHBP) >> 16U)) << 16U);
			  LTDC_LAYER(LTDC, LayerIdx)->WHPCR &= ~(LTDC_LxWHPCR_WHSTPOS | LTDC_LxWHPCR_WHSPPOS);
			  LTDC_LAYER(LTDC, LayerIdx)->WHPCR = ((Layercfg_WindowX0 + ((LTDC->BPCR & LTDC_BPCR_AHBP) >> 16U) + 1U) | tmp);

			  /* Configure the vertical start and stop position */
			  tmp = ((Layercfg_WindowY1 + (LTDC->BPCR & LTDC_BPCR_AVBP)) << 16U);
			  LTDC_LAYER(LTDC, LayerIdx)->WVPCR &= ~(LTDC_LxWVPCR_WVSTPOS | LTDC_LxWVPCR_WVSPPOS);
			  LTDC_LAYER(LTDC, LayerIdx)->WVPCR  = ((Layercfg_WindowY0 + (LTDC->BPCR & LTDC_BPCR_AVBP) + 1U) | tmp);

			  /* Specifies the pixel format */
			  LTDC_LAYER(LTDC, LayerIdx)->PFCR &= ~(LTDC_LxPFCR_PF);
			  LTDC_LAYER(LTDC, LayerIdx)->PFCR = (Layercfg_PixelFormat);

			  /* Configure the default color values */
			  tmp = ((uint32_t)(Layercfg_Backcolor_Green) << 8U);
			  tmp1 = ((uint32_t)(Layercfg_Backcolor_Red) << 16U);
			  uint32_t tmp2 = (Layercfg_Alpha0 << 24U);
			  LTDC_LAYER(LTDC, LayerIdx)->DCCR &= ~(LTDC_LxDCCR_DCBLUE | LTDC_LxDCCR_DCGREEN | LTDC_LxDCCR_DCRED | LTDC_LxDCCR_DCALPHA);
			  LTDC_LAYER(LTDC, LayerIdx)->DCCR = (Layercfg_Backcolor_Blue | tmp | tmp1 | tmp2);

			  /* Specifies the constant alpha value */
			  LTDC_LAYER(LTDC, LayerIdx)->CACR &= ~(LTDC_LxCACR_CONSTA);
			  LTDC_LAYER(LTDC, LayerIdx)->CACR = (Layercfg_Alpha);

			  /* Specifies the blending factors */
			  LTDC_LAYER(LTDC, LayerIdx)->BFCR &= ~(LTDC_LxBFCR_BF2 | LTDC_LxBFCR_BF1);
			  LTDC_LAYER(LTDC, LayerIdx)->BFCR = (Layercfg_BlendingFactor1 | Layercfg_BlendingFactor2);

			  /* Configure the color frame buffer start address */
			  LTDC_LAYER(LTDC, LayerIdx)->CFBAR &= ~(LTDC_LxCFBAR_CFBADD);
			  LTDC_LAYER(LTDC, LayerIdx)->CFBAR = (Layercfg_FBStartAdress);

			  if (Layercfg_PixelFormat == LTDC_PIXEL_FORMAT_ARGB8888)
			  {
			    tmp = 4U;
			  }
			  else if (Layercfg_PixelFormat == LTDC_PIXEL_FORMAT_RGB888)
			  {
			    tmp = 3U;
			  }
			  else if ((Layercfg_PixelFormat == LTDC_PIXEL_FORMAT_ARGB4444) || \
			           (Layercfg_PixelFormat == LTDC_PIXEL_FORMAT_RGB565)   || \
			           (Layercfg_PixelFormat == LTDC_PIXEL_FORMAT_ARGB1555) || \
			           (Layercfg_PixelFormat == LTDC_PIXEL_FORMAT_AL88))
			  {
			    tmp = 2U;
			  }
			  else
			  {
			    tmp = 1U;
			  }

			  /* Configure the color frame buffer pitch in byte */
			  LTDC_LAYER(LTDC, LayerIdx)->CFBLR  &= ~(LTDC_LxCFBLR_CFBLL | LTDC_LxCFBLR_CFBP);
			  LTDC_LAYER(LTDC, LayerIdx)->CFBLR  = (((Layercfg_ImageWidth * tmp) << 16U) | (((Layercfg_WindowX1 - Layercfg_WindowX0) * tmp)  + 3U));
			  /* Configure the frame buffer line number */
			  LTDC_LAYER(LTDC, LayerIdx)->CFBLNR  &= ~(LTDC_LxCFBLNR_CFBLNBR);
			  LTDC_LAYER(LTDC, LayerIdx)->CFBLNR  = (Layercfg_ImageHeight);

			  /* Enable LTDC_Layer by setting LEN bit */
			  LTDC_LAYER(LTDC, LayerIdx)->CR |= (uint32_t)LTDC_LxCR_LEN;


			  /* Set the Immediate Reload type */
			  LTDC->SRCR = LTDC_SRCR_IMR;
			  BSP_LCD_DisplayOn();
#endif
			  ///			  ///ENDS:BSP_LCD_LayerDefaultInit


	return 0;
}
void BSP_LCD_DisplayOn2(void){
    DSI_ShortWrite(OTM8009A_ORIENTATION_PORTRAIT,
                       DSI_DCS_SHORT_PKT_WRITE_P1,
                       OTM8009A_CMD_DISPON,
                       0x00);
}

