abusous2000/uGFX-2.7/boards/base/STM32F769i-Discovery/STM32DSI.c
int postInitDSI(orientation_t orientation){
#if 1//ndef INCLUDES_ALL
	BSP_SDRAM_Init();
	OTM8009A_Init(OTM8009A_FORMAT_RGB888, orientation==GDISP_ROTATE_PORTRAIT?OTM8009A_ORIENTATION_PORTRAIT:OTM8009A_ORIENTATION_LANDSCAPE);
//	BSP_LCD_DisplayOn();
#endif
	//9-HAL_DSI_Start(&hdsi_discovery);

//	  /* Initialize the font */
////	BSP_LCD_SetFont(&LCD_DEFAULT_FONT);
//
//
//	OTM8009A_Init(OTM8009A_FORMAT_RGB888, OTM8009A_ORIENTATION_PORTRAIT);
//	//
////    BSP_TS_Init(800, 480);
//
//	BSP_LCD_DisplayOn();
	return 0;
}
uint8_t DSI_ShortWrite(uint32_t ChannelID, uint32_t Mode, uint32_t Param1, uint32_t Param2){
  WAIT_FOR_DSI_FLAG(DSI->GPSR & DSI_GPSR_CMDFE)
  /* Configure the packet to send a short DCS command with 0 or 1 parameter */
  /* Update the DSI packet header with new information */
  DSI->GHCR = (Mode | (ChannelID << 6U) | (Param1 << 8U) | (Param2 << 16U));

  return 0;
}
static void DSI_ConfigPacketHeader(DSI_TypeDef *DSIx,
                                   uint32_t ChannelID,
                                   uint32_t DataType,
                                   uint32_t Data0,
                                   uint32_t Data1)
{
  /* Update the DSI packet header with new information */
  DSIx->GHCR = (DataType | (ChannelID << 6U) | (Data0 << 8U) | (Data1 << 16U));
}
uint8_t DSI_LongWrite(uint32_t ChannelID, uint32_t Mode, uint32_t NbParams,  uint32_t Param1, uint8_t *ParametersTable){
  WAIT_FOR_DSI_FLAG(DSI->GPSR & DSI_GPSR_CMDFE)
  uint32_t uicounter, nbBytes, count;
  uint32_t tickstart;
  uint32_t fifoword;
  uint8_t *pparams = ParametersTable;

  /* Set the DCS code on payload byte 1, and the other parameters on the write FIFO command*/
   fifoword = Param1;
   nbBytes = (NbParams < 3U) ? NbParams : 3U;

   for (count = 0U; count < nbBytes; count++)
   {
     fifoword |= (((uint32_t)(*(pparams + count))) << (8U + (8U * count)));
   }
   DSI->GPDR = fifoword;

   uicounter = NbParams - nbBytes;
   pparams += nbBytes;
   /* Set the Next parameters on the write FIFO command*/
   while (uicounter != 0U)
   {
     nbBytes = (uicounter < 4U) ? uicounter : 4U;
     fifoword = 0U;
     for (count = 0U; count < nbBytes; count++)
     {
       fifoword |= (((uint32_t)(*(pparams + count))) << (8U * count));
     }
     DSI->GPDR = fifoword;

     uicounter -= nbBytes;
     pparams += nbBytes;
   }

   /* Configure the packet to send a long DCS command */
   DSI_ConfigPacketHeader(DSI,
                          ChannelID,
                          Mode,
                          ((NbParams + 1U) & 0x00FFU),
                          (((NbParams + 1U) & 0xFF00U) >> 8U));


   return 0;
}
void setBacklightPWM(uint8_t percent) {
   DSI_ShortWrite(LCD_OTM8009A_ID, DSI_DCS_SHORT_PKT_WRITE_P1, OTM8009A_CMD_WRDISBV, (uint16_t)(percent * 255)/100);
}
void OTM8009A_IO_Delay(uint32_t Delay)
{
	chThdSleepMilliseconds(Delay);
}
void HAL_Delay(uint32_t Delay)
{
	chThdSleepMilliseconds(Delay);
}

uint32_t timeI2MS(uint32_t interval){
	return TIME_I2MS(interval);
}

void DSI_IO_WriteCmd(uint32_t NbrParams, uint8_t *pParams)
{
	uint8_t rc = 0;
  if(NbrParams <= 1)
  {
     rc = DSI_ShortWrite(LCD_OTM8009A_ID, DSI_DCS_SHORT_PKT_WRITE_P1, pParams[0], pParams[1]);
  }
  else
  {
    rc = DSI_LongWrite(LCD_OTM8009A_ID, DSI_DCS_LONG_PKT_WRITE, NbrParams, pParams[NbrParams], pParams);
  }

  if ( rc )
	  rc = 0;
  else
	  rc = 1;
}
typedef struct
{
  uint32_t             Mode;               /*!< Configures the DMA2D transfer mode.
                                                This parameter can be one value of @ref DMA2D_Mode. */

  uint32_t             ColorMode;          /*!< Configures the color format of the output image.
                                                This parameter can be one value of @ref DMA2D_Output_Color_Mode. */

  uint32_t             OutputOffset;       /*!< Specifies the Offset value.
                                                This parameter must be a number between Min_Data = 0x0000 and Max_Data = 0x3FFF. */
#if defined (DMA2D_ALPHA_INV_RB_SWAP_SUPPORT)
  uint32_t             AlphaInverted;     /*!< Select regular or inverted alpha value for the output pixel format converter.
                                               This parameter can be one value of @ref DMA2D_Alpha_Inverted. */

  uint32_t             RedBlueSwap;       /*!< Select regular mode (RGB or ARGB) or swap mode (BGR or ABGR)
                                               for the output pixel format converter.
                                               This parameter can be one value of @ref DMA2D_RB_Swap. */

#endif /* DMA2D_ALPHA_INV_RB_SWAP_SUPPORT */




} DMA2D_InitTypeDef;
typedef struct
{
  uint32_t             InputOffset;       /*!< Configures the DMA2D foreground or background offset.
                                               This parameter must be a number between Min_Data = 0x0000 and Max_Data = 0x3FFF. */

  uint32_t             InputColorMode;    /*!< Configures the DMA2D foreground or background color mode.
                                               This parameter can be one value of @ref DMA2D_Input_Color_Mode. */

  uint32_t             AlphaMode;         /*!< Configures the DMA2D foreground or background alpha mode.
                                               This parameter can be one value of @ref DMA2D_Alpha_Mode. */

  uint32_t             InputAlpha;        /*!< Specifies the DMA2D foreground or background alpha value and color value in case of A8 or A4 color mode.
                                               This parameter must be a number between Min_Data = 0x00 and Max_Data = 0xFF except for the color modes detailed below.
                                               @note In case of A8 or A4 color mode (ARGB), this parameter must be a number between
                                               Min_Data = 0x00000000 and Max_Data = 0xFFFFFFFF where
                                               - InputAlpha[24:31] is the alpha value ALPHA[0:7]
                                               - InputAlpha[16:23] is the red value RED[0:7]
                                               - InputAlpha[8:15] is the green value GREEN[0:7]
                                               - InputAlpha[0:7] is the blue value BLUE[0:7]. */
#if defined (DMA2D_ALPHA_INV_RB_SWAP_SUPPORT)
  uint32_t             AlphaInverted;     /*!< Select regular or inverted alpha value.
                                               This parameter can be one value of @ref DMA2D_Alpha_Inverted. */

  uint32_t             RedBlueSwap;       /*!< Select regular mode (RGB or ARGB) or swap mode (BGR or ABGR).
                                               This parameter can be one value of @ref DMA2D_RB_Swap. */
#endif /* DMA2D_ALPHA_INV_RB_SWAP_SUPPORT  */


} DMA2D_LayerCfgTypeDef;


#define MAX_DMA2D_LAYER  2U


typedef struct __DMA2D_HandleTypeDef
{
  DMA2D_TypeDef               *Instance;                                                    /*!< DMA2D register base address.               */

  DMA2D_InitTypeDef           Init;                                                         /*!< DMA2D communication parameters.            */

  DMA2D_LayerCfgTypeDef       LayerCfg[MAX_DMA2D_LAYER];                                    /*!< DMA2D Layers parameters           */

  __IO uint32_t               ErrorCode;                                                    /*!< DMA2D error code.                          */
} DMA2D_HandleTypeDef;
#define DMA2D_R2M                   DMA2D_CR_MODE            /*!< DMA2D register to memory transfer mode */
#define DMA2D_OUTPUT_ARGB8888       0x00000000U                           /*!< ARGB8888 DMA2D color mode */
#define HAL_OK 						0
#define MODIFY_REG(REG, CLEARMASK, SETMASK)  WRITE_REG((REG), (((READ_REG(REG)) & (~(CLEARMASK))) | (SETMASK)))
#define DMA2D_INPUT_A8              0x00000009U  /*!< A8 color mode       */
#define DMA2D_INPUT_A4              0x0000000AU  /*!< A4 color mode       */
#define DMA2D_M2M                   0x00000000U                         /*!< DMA2D memory to memory transfer mode */
#define DMA2D_BACKGROUND_LAYER             0x00000000U   /*!< DMA2D Background Layer (layer 0) */
#define DMA2D_FOREGROUND_LAYER             0x00000001U   /*!< DMA2D Foreground Layer (layer 1) */
#define DMA2D_OUTPUT_ARGB8888       0x00000000U                           /*!< ARGB8888 DMA2D color mode */
#define DMA2D_OUTPUT_RGB888         DMA2D_OPFCCR_CM_0                     /*!< RGB888 DMA2D color mode   */
#define DMA2D_OUTPUT_RGB565         DMA2D_OPFCCR_CM_1                     /*!< RGB565 DMA2D color mode   */
#define DMA2D_OUTPUT_ARGB1555       (DMA2D_OPFCCR_CM_0|DMA2D_OPFCCR_CM_1) /*!< ARGB1555 DMA2D color mode */
#define DMA2D_OUTPUT_ARGB4444       DMA2D_OPFCCR_CM_2                     /*!< ARGB4444 DMA2D color mode */



uint8_t HAL_DMA2D_Init(DMA2D_HandleTypeDef *hdma2d)
{
	 MODIFY_REG(hdma2d->Instance->CR, DMA2D_CR_MODE, hdma2d->Init.Mode);

