abusous2000/uGFX-2.7/boards/base/STM32F769i-Discovery/STM32DSI.c
	  /* DMA2D OPFCCR register configuration ---------------------------------------*/
	  MODIFY_REG(hdma2d->Instance->OPFCCR, DMA2D_OPFCCR_CM, hdma2d->Init.ColorMode);

	  /* DMA2D OOR register configuration ------------------------------------------*/
	  MODIFY_REG(hdma2d->Instance->OOR, DMA2D_OOR_LO, hdma2d->Init.OutputOffset);
	#if defined (DMA2D_ALPHA_INV_RB_SWAP_SUPPORT)
	  /* DMA2D OPFCCR AI and RBS fields setting (Output Alpha Inversion)*/
	  MODIFY_REG(hdma2d->Instance->OPFCCR,(DMA2D_OPFCCR_AI|DMA2D_OPFCCR_RBS), ((hdma2d->Init.AlphaInverted << DMA2D_OPFCCR_AI_Pos) | (hdma2d->Init.RedBlueSwap << DMA2D_OPFCCR_RBS_Pos)));
	#endif /* DMA2D_ALPHA_INV_RB_SWAP_SUPPORT */

	return HAL_OK;
}
uint8_t HAL_DMA2D_ConfigLayer(DMA2D_HandleTypeDef *hdma2d, uint32_t LayerIdx)
{
	  DMA2D_LayerCfgTypeDef *pLayerCfg;
	  uint32_t regMask, regValue;

	  if(hdma2d->Init.Mode != DMA2D_R2M)
	  {
	  }
	  pLayerCfg = &hdma2d->LayerCfg[LayerIdx];

	  /* Prepare the value to be written to the BGPFCCR or FGPFCCR register */
	#if defined (DMA2D_ALPHA_INV_RB_SWAP_SUPPORT)
	  regValue = pLayerCfg->InputColorMode | (pLayerCfg->AlphaMode << DMA2D_BGPFCCR_AM_Pos) |\
	             (pLayerCfg->AlphaInverted << DMA2D_BGPFCCR_AI_Pos) | (pLayerCfg->RedBlueSwap << DMA2D_BGPFCCR_RBS_Pos);
	  regMask  = (DMA2D_BGPFCCR_CM | DMA2D_BGPFCCR_AM | DMA2D_BGPFCCR_ALPHA | DMA2D_BGPFCCR_AI | DMA2D_BGPFCCR_RBS);
	#else
	  regValue = pLayerCfg->InputColorMode | (pLayerCfg->AlphaMode << DMA2D_BGPFCCR_AM_Pos);
	  regMask  = DMA2D_BGPFCCR_CM | DMA2D_BGPFCCR_AM | DMA2D_BGPFCCR_ALPHA;
	#endif /* DMA2D_ALPHA_INV_RB_SWAP_SUPPORT */


	  if ((pLayerCfg->InputColorMode == DMA2D_INPUT_A4) || (pLayerCfg->InputColorMode == DMA2D_INPUT_A8))
	  {
	    regValue |= (pLayerCfg->InputAlpha & DMA2D_BGPFCCR_ALPHA);
	  }
	  else
	  {
	    regValue |=  (pLayerCfg->InputAlpha << DMA2D_BGPFCCR_ALPHA_Pos);
	  }

	  /* Configure the background DMA2D layer */
	  if(LayerIdx == DMA2D_BACKGROUND_LAYER)
	  {
	    /* Write DMA2D BGPFCCR register */
	    MODIFY_REG(hdma2d->Instance->BGPFCCR, regMask, regValue);

	    /* DMA2D BGOR register configuration -------------------------------------*/
	    WRITE_REG(hdma2d->Instance->BGOR, pLayerCfg->InputOffset);

	    /* DMA2D BGCOLR register configuration -------------------------------------*/
	    if ((pLayerCfg->InputColorMode == DMA2D_INPUT_A4) || (pLayerCfg->InputColorMode == DMA2D_INPUT_A8))
	    {
	      WRITE_REG(hdma2d->Instance->BGCOLR, pLayerCfg->InputAlpha & (DMA2D_BGCOLR_BLUE|DMA2D_BGCOLR_GREEN|DMA2D_BGCOLR_RED));
	    }
	  }
	  /* Configure the foreground DMA2D layer */
	  else
	  {


	     /* Write DMA2D FGPFCCR register */
	    MODIFY_REG(hdma2d->Instance->FGPFCCR, regMask, regValue);

	    /* DMA2D FGOR register configuration -------------------------------------*/
	    WRITE_REG(hdma2d->Instance->FGOR, pLayerCfg->InputOffset);

	    /* DMA2D FGCOLR register configuration -------------------------------------*/
	    if ((pLayerCfg->InputColorMode == DMA2D_INPUT_A4) || (pLayerCfg->InputColorMode == DMA2D_INPUT_A8))
	    {
	      WRITE_REG(hdma2d->Instance->FGCOLR, pLayerCfg->InputAlpha & (DMA2D_FGCOLR_BLUE|DMA2D_FGCOLR_GREEN|DMA2D_FGCOLR_RED));
	    }
	  }

	return HAL_OK;
}
uint8_t HAL_DMA2D_Start(DMA2D_HandleTypeDef *hdma2d, uint32_t pdata, uint32_t DstAddress, uint32_t Width,  uint32_t Height)
{
	 uint32_t tmp;
	  uint32_t tmp1;
	  uint32_t tmp2;
	  uint32_t tmp3;
	  uint32_t tmp4;

	  /* Configure DMA2D data size */
	  MODIFY_REG(hdma2d->Instance->NLR, (DMA2D_NLR_NL|DMA2D_NLR_PL), (Height| (Width << DMA2D_NLR_PL_Pos)));

	  /* Configure DMA2D destination address */
	  WRITE_REG(hdma2d->Instance->OMAR, DstAddress);

	  /* Register to memory DMA2D mode selected */
	  if (hdma2d->Init.Mode == DMA2D_R2M)
	  {
	    tmp1 = pdata & DMA2D_OCOLR_ALPHA_1;
	    tmp2 = pdata & DMA2D_OCOLR_RED_1;
	    tmp3 = pdata & DMA2D_OCOLR_GREEN_1;
	    tmp4 = pdata & DMA2D_OCOLR_BLUE_1;

	    /* Prepare the value to be written to the OCOLR register according to the color mode */
	    if (hdma2d->Init.ColorMode == DMA2D_OUTPUT_ARGB8888)
	    {
	      tmp = (tmp3 | tmp2 | tmp1| tmp4);
	    }
	    else if (hdma2d->Init.ColorMode == DMA2D_OUTPUT_RGB888)
	    {
	      tmp = (tmp3 | tmp2 | tmp4);
	    }
	    else if (hdma2d->Init.ColorMode == DMA2D_OUTPUT_RGB565)
	    {
	      tmp2 = (tmp2 >> 19U);
	      tmp3 = (tmp3 >> 10U);
	      tmp4 = (tmp4 >> 3U );
	      tmp  = ((tmp3 << 5U) | (tmp2 << 11U) | tmp4);
	    }
	    else if (hdma2d->Init.ColorMode == DMA2D_OUTPUT_ARGB1555)
	    {
	      tmp1 = (tmp1 >> 31U);
	      tmp2 = (tmp2 >> 19U);
	      tmp3 = (tmp3 >> 11U);
	      tmp4 = (tmp4 >> 3U );
	      tmp  = ((tmp3 << 5U) | (tmp2 << 10U) | (tmp1 << 15U) | tmp4);
	    }
	    else /* Dhdma2d->Init.ColorMode = DMA2D_OUTPUT_ARGB4444 */
	    {
	      tmp1 = (tmp1 >> 28U);
	      tmp2 = (tmp2 >> 20U);
	      tmp3 = (tmp3 >> 12U);
	      tmp4 = (tmp4 >> 4U );
	      tmp  = ((tmp3 << 4U) | (tmp2 << 8U) | (tmp1 << 12U) | tmp4);
	    }
	    /* Write to DMA2D OCOLR register */
	    WRITE_REG(hdma2d->Instance->OCOLR, tmp);
	  }
	  else /* M2M, M2M_PFC or M2M_Blending DMA2D Mode */
	  {
	    /* Configure DMA2D source address */
	    WRITE_REG(hdma2d->Instance->FGMAR, pdata);
	  }

	return HAL_OK;
}
#define HAL_ERROR 				-1
#define __HAL_DMA2D_GET_FLAG(__HANDLE__, __FLAG__) ((__HANDLE__)->Instance->ISR & (__FLAG__))
#define __HAL_DMA2D_CLEAR_FLAG(__HANDLE__, __FLAG__) ((__HANDLE__)->Instance->IFCR = (__FLAG__))
#define __HAL_DMA2D_ENABLE_IT(__HANDLE__, __INTERRUPT__) ((__HANDLE__)->Instance->CR |= (__INTERRUPT__))
#define __HAL_DMA2D_DISABLE_IT(__HANDLE__, __INTERRUPT__) ((__HANDLE__)->Instance->CR &= ~(__INTERRUPT__))
#define __HAL_DMA2D_GET_IT_SOURCE(__HANDLE__, __INTERRUPT__) ((__HANDLE__)->Instance->CR & (__INTERRUPT__))
#define DMA2D_FLAG_CE               DMA2D_ISR_CEIF           /*!< Configuration Error Interrupt Flag */
#define DMA2D_FLAG_CTC              DMA2D_ISR_CTCIF          /*!< CLUT Transfer Complete Interrupt Flag */
#define DMA2D_FLAG_CAE              DMA2D_ISR_CAEIF          /*!< CLUT Access Error Interrupt Flag */
#define DMA2D_FLAG_TW               DMA2D_ISR_TWIF           /*!< Transfer Watermark Interrupt Flag */
#define DMA2D_FLAG_TC               DMA2D_ISR_TCIF           /*!< Transfer Complete Interrupt Flag */
#define DMA2D_FLAG_TE               DMA2D_ISR_TEIF           /*!< Transfer Error Interrupt Flag */
#define DMA2D_IT_CE                 DMA2D_CR_CEIE            /*!< Configuration Error Interrupt */
#define DMA2D_IT_CTC                DMA2D_CR_CTCIE           /*!< CLUT Transfer Complete Interrupt */
#define DMA2D_IT_CAE                DMA2D_CR_CAEIE           /*!< CLUT Access Error Interrupt */
#define DMA2D_IT_TW                 DMA2D_CR_TWIE            /*!< Transfer Watermark Interrupt */
#define DMA2D_IT_TC                 DMA2D_CR_TCIE            /*!< Transfer Complete Interrupt */
#define DMA2D_IT_TE                 DMA2D_CR_TEIE            /*!< Transfer Error Interrupt */
#define HAL_DMA2D_ERROR_NONE        0x00000000U  /*!< No error             */
#define HAL_DMA2D_ERROR_TE          0x00000001U  /*!< Transfer error       */
#define HAL_DMA2D_ERROR_CE          0x00000002U  /*!< Configuration error  */
#define HAL_DMA2D_ERROR_CAE         0x00000004U  /*!< CLUT access error    */
#define HAL_DMA2D_ERROR_TIMEOUT     0x00000020U  /*!< Timeout error        */
#define HAL_MAX_DELAY      0xFFFFFFFFU
uint8_t HAL_DMA2D_PollForTransfer(DMA2D_HandleTypeDef *hdma2d, uint32_t Timeout)
{
	  uint32_t tickstart;
	  uint32_t layer_start;
	  __IO uint32_t isrflags = 0x0U;

	  /* Polling for DMA2D transfer */
	  if((hdma2d->Instance->CR & DMA2D_CR_START) != 0U)
	  {
	   /* Get tick */
	   tickstart = st_lld_get_counter();

	    while(__HAL_DMA2D_GET_FLAG(hdma2d, DMA2D_FLAG_TC) == 0U)
	    {
	      isrflags = READ_REG(hdma2d->Instance->ISR);
	      if ((isrflags & (DMA2D_FLAG_CE|DMA2D_FLAG_TE)) != 0U)
	      {
	        if ((isrflags & DMA2D_FLAG_CE) != 0U)
	        {
	          hdma2d->ErrorCode |= HAL_DMA2D_ERROR_CE;
	        }
	        if ((isrflags & DMA2D_FLAG_TE) != 0U)
	        {
	          hdma2d->ErrorCode |= HAL_DMA2D_ERROR_TE;
	        }
	        /* Clear the transfer and configuration error flags */
	        __HAL_DMA2D_CLEAR_FLAG(hdma2d, DMA2D_FLAG_CE | DMA2D_FLAG_TE);

	        return HAL_ERROR;
	      }
	      /* Check for the Timeout */
	      if(Timeout != HAL_MAX_DELAY)
	      {
	        if(( TIME_I2MS(st_lld_get_counter() - tickstart ) > Timeout)||(Timeout == 0U))
	        {
	          /* Update error code */
	          hdma2d->ErrorCode |= HAL_DMA2D_ERROR_TIMEOUT;
 	          return HAL_TIMEOUT;
	        }
	      }
	    }
	  }
	  /* Polling for CLUT loading (foreground or background) */
	  layer_start = hdma2d->Instance->FGPFCCR & DMA2D_FGPFCCR_START;
	  layer_start |= hdma2d->Instance->BGPFCCR & DMA2D_BGPFCCR_START;
	  if (layer_start != 0U)
	  {
	    /* Get tick */
	    tickstart = st_lld_get_counter();

	    while(__HAL_DMA2D_GET_FLAG(hdma2d, DMA2D_FLAG_CTC) == 0U)
	    {
	      isrflags = READ_REG(hdma2d->Instance->ISR);
	      if ((isrflags & (DMA2D_FLAG_CAE|DMA2D_FLAG_CE|DMA2D_FLAG_TE)) != 0U)
	      {
	        if ((isrflags & DMA2D_FLAG_CAE) != 0U)
	        {
	          hdma2d->ErrorCode |= HAL_DMA2D_ERROR_CAE;
	        }
	        if ((isrflags & DMA2D_FLAG_CE) != 0U)
	        {
	          hdma2d->ErrorCode |= HAL_DMA2D_ERROR_CE;
	        }
	        if ((isrflags & DMA2D_FLAG_TE) != 0U)
	        {
	          hdma2d->ErrorCode |= HAL_DMA2D_ERROR_TE;
	        }
	        /* Clear the CLUT Access Error, Configuration Error and Transfer Error flags */
	        __HAL_DMA2D_CLEAR_FLAG(hdma2d, DMA2D_FLAG_CAE | DMA2D_FLAG_CE | DMA2D_FLAG_TE);


	        return HAL_ERROR;
	      }
	      /* Check for the Timeout */
	      if(Timeout != HAL_MAX_DELAY)
	      {
	        if( (TIME_I2MS(st_lld_get_counter() - tickstart ) > Timeout)||(Timeout == 0U))
	        {
	          /* Update error code */
	          hdma2d->ErrorCode |= HAL_DMA2D_ERROR_TIMEOUT;


