abusous2000/uGFX-2.7/boards/base/STM32F769i-Discovery/STM32DSI.c
	          return HAL_TIMEOUT;
	        }
	      }
	    }
	  }

	  /* Clear the transfer complete and CLUT loading flags */
	  __HAL_DMA2D_CLEAR_FLAG(hdma2d, DMA2D_FLAG_TC|DMA2D_FLAG_CTC);
	return HAL_OK;
}
static DMA2D_HandleTypeDef hdma2d_discovery;
static void LL_FillBuffer(uint32_t LayerIndex, void *pDst, uint32_t xSize, uint32_t ySize, uint32_t OffLine, uint32_t ColorIndex)
{
  /* Register to memory mode with ARGB8888 as color Mode */
  hdma2d_discovery.Init.Mode         = DMA2D_R2M;
  hdma2d_discovery.Init.ColorMode    = DMA2D_OUTPUT_RGB888;
  hdma2d_discovery.Init.OutputOffset = OffLine;

  hdma2d_discovery.Instance = DMA2D;

  /* DMA2D Initialization */
  if(HAL_DMA2D_Init(&hdma2d_discovery) == HAL_OK)
  {
    if(HAL_DMA2D_ConfigLayer(&hdma2d_discovery, LayerIndex) == HAL_OK){
      if (HAL_DMA2D_Start(&hdma2d_discovery, ColorIndex, (uint32_t)pDst, xSize, ySize) == HAL_OK){
        /* Polling For DMA transfer */
        HAL_DMA2D_PollForTransfer(&hdma2d_discovery, 10);
      }
    }
  }
}
#define DMA2D_M2M_PFC               DMA2D_CR_MODE_0                     /*!< DMA2D memory to memory with pixel format conversion transfer mode */
#define DMA2D_NO_MODIF_ALPHA        0x00000000U  /*!< No modification of the alpha channel value */



void BSP_LCD_Clear(uint32_t LayerIndex, uint32_t Color, uint32_t *FBStartAdress){


  /* Clear the LCD */
  LL_FillBuffer(LayerIndex, FBStartAdress, 800, 480, 0, Color);
}

void HAL_DSI_MspDeInit(DSI_HandleTypeDef *hdsi){UNUSED(hdsi);
	  ///Start----->HAL_DSI_DeInit(&(hdsi_discovery));
	  __HAL_DSI_WRAPPER_DISABLE(DSI);

	  /* Disable the DSI host */
	  __HAL_DSI_DISABLE(DSI);

	  /* D-PHY clock and digital disable */
	  DSI->PCTLR &= ~(DSI_PCTLR_CKE | DSI_PCTLR_DEN);

	  /* Turn off the DSI PLL */
	  __HAL_DSI_PLL_DISABLE(DSI);

	  /* Disable the regulator */
	  __HAL_DSI_REG_DISABLE(DSI);

	  ///ENDs----->HAL_DSI_DeInit(&(hdsi_discovery));

}
HAL_StatusTypeDef HAL_DSI_DeInit(DSI_HandleTypeDef *hdsi)
{
  /* Check the DSI handle allocation */
  if (hdsi == NULL)
  {
    return HAL_ERROR;
  }

  /* Change DSI peripheral state */
  hdsi->State = HAL_DSI_STATE_BUSY;

  /* Disable the DSI wrapper */
  __HAL_DSI_WRAPPER_DISABLE(DSI);

  /* Disable the DSI host */
  __HAL_DSI_DISABLE(DSI);

  /* D-PHY clock and digital disable */
  hdsi->Instance->PCTLR &= ~(DSI_PCTLR_CKE | DSI_PCTLR_DEN);

  /* Turn off the DSI PLL */
  __HAL_DSI_PLL_DISABLE(DSI);

  /* Disable the regulator */
  __HAL_DSI_REG_DISABLE(DSI);

#if (USE_HAL_DSI_REGISTER_CALLBACKS == 1)
  if (hdsi->MspDeInitCallback == NULL)
  {
    hdsi->MspDeInitCallback = HAL_DSI_MspDeInit;
  }
  /* DeInit the low level hardware */
  hdsi->MspDeInitCallback(hdsi);
#else
  /* DeInit the low level hardware */
  HAL_DSI_MspDeInit(hdsi);
#endif /* USE_HAL_DSI_REGISTER_CALLBACKS */

  /* Initialise the error code */
  hdsi->ErrorCode = HAL_DSI_ERROR_NONE;

  /* Initialize the DSI state*/
  hdsi->State = HAL_DSI_STATE_RESET;

  /* Release Lock */
  __HAL_UNLOCK(hdsi);

  return HAL_OK;
}
#endif
